Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: You may mail your bug reports (be sure to include full configuration information as output by the myconfig program in the perl source tree, or by C<perl -V>) to perlbug@perl.org . If you've succeeded in compiling perl, the L<perlbug> script in the F<utils/> subdirectory can be used to help mail in a bug report.
es: Puede enviar informes de error a través de la dirección perlbug@perl.org (no olvide incluir toda la información de configuración emitida por el programa myconfig en el árbol de código fuente de perl, o por C<perl -V>). Si ha logrado compilar perl, puede utilizar el script L<perlbug> del subdirectorio F<utils/> para enviar informes de error.

source: You may need to set some configuration variables for your particular email service provider.
es: Es posible que tenga que establecer algunas variables de configuración específicas de su proveedor de correo electrónico.

source: You may or may not choose to follow this usage.
es: Puede elegir seguir esta convención o no,

source: You may see this idiom in the wild combined with a call to C<can>:
es: Puede observar este modismo en la siguiente llamada a C<can>:

source: You may see this sort of thing when looking at code in the wild.
es: Puede encontrarse con este tipo de cosas al examinar código Perl ajeno.

source: You may snoop on pending developments via the archives at http://www.xray.mpe.mpg.de/mailing-lists/perl5-porters/ and http://archive.develooper.com/perl5-porters@perl.org/ or the news gateway nntp://nntp.perl.org/perl.perl5.porters or its web interface at http://nntp.perl.org/group/perl.perl5.porters , or read the faq at http://dev.perl.org/perl5/docs/p5p-faq.html , or you can subscribe to the mailing list by sending perl5-porters-subscribe@perl.org a subscription request (an empty message with no subject is fine).
es: Si desea curiosear los desarrollos pendientes, puede consultar el archivo mensajes de la lista de correo en http://www.xray.mpe.mpg.de/mailing-lists/perl5-porters/ y http://archive.develooper.com/perl5-porters@perl.org/, o el grupo de noticias nntp://nntp.perl.org/perl.perl5.porters (también está disponible a través de una interfaz web en http://nntp.perl.org/group/perl.perl5.porters), o bien leer las preguntas más frecuentes en http://dev.perl.org/perl5/docs/p5p-faq.html. También puede suscribirse a la lista de correo enviando una solicitud de suscripción a perl5-porters-subscribe@perl.org (solo tiene que enviar un mensaje vacío sin asunto).

source: You may still see C<require 'syscall.ph'> or similar around - the F<.ph> file should be created by running F<h2ph> on the corresponding F<.h> file.
es: Es posible que se encuentre código en el que se usa C<require 'syscall.ph'> o algo similar; para crear el archivo F<.ph> se debe ejecutar F<h2ph> en el archivo F<.h> correspondiente.

source: You may turn it off explicitly for particular portions of code via the C<no warnings> pragma or the C<$^W> variable if you must.
es: Puede desactivarla explícitamente en partes del código con el pragma C<no warnings> o con la variable C<$^W>, si así lo desea.

source: You may, however, wish to treat a string as a multi-line buffer, such that the "^" will match after any newline within the string (except if the newline is the last character in the string), and "$" will match before any newline.
es: Sin embargo, puede que desee tratar a la cadena como un búfer de varias líneas, de modo que "^" coincida después de cualquier carácter de nueva línea que haya en la cadena (excepto si dicho carácter es el último en la cadena), y "$" coincida delante de cualquier carácter de nueva línea.

source: You might be able to use the CPAN instructions from the "Unix or Linux" section above as well; give it a try.
es: Es posible que las instrucciones de CPAN especificadas en la sección sobre "Unix o Linux" anterior también funcionen; haga la prueba.

source: You might also want to read through L<perlsource> too.
es: También debería leer L<perlsource>.

source: You might also see the terms B<getter> and B<setter>.
es: También puede ver los términos B<getter> y B<setter>.

source: You might also want to check out L<perlfaq8/"How do I keep my own module/library directory?">.
es: Es posible que también le interese consultar "¿Qué tengo que hacer para mantener mi propio directorio de módulos/bibliotecas?" en L.

source: You might be able to find existing binaries on the CPAN or elsewhere, or you might want to try getting compilers and building it yourself, and then release the binary for other poor souls to use.
es: Quizás sea capaz de encontrar los binarios en CPAN o en otro lugar, o puede que prefiera obtener los compiladores e intentar la compilación (en ese caso, no olvide publicar luego el binario para regocijo de otras almas desventuradas).

source: You might be tempted to use C<$#array + 1> to tell you how many items there are in an array.
es: Podría sentirse tentado de usar C<$#array + 1> para determinar el número de elementos de un array.

source: You might even try the "I feel lucky" button.
es: Incluso puede probar el botón "Voy a tener suerte"

source: You might feel that everyone else needs it.
es: crea que a todo el mundo le vendría bien,

source: You might find these links useful:
es: Es posible que estos vínculos le resulten de utilidad:

source: You might have expected test 3 to fail because it seems to a more general purpose version of test 1.
es: Puede que esperara un error en la prueba 3, ya que parece una versión más general de la prueba 1.

source: You might love it.
es: Es posible que su módulo le encante y que

source: You might not think that one typo fix would break a test file.
es: Seguramente crea que es imposible que un error ortográfico genere un error de un archivo de prueba.

source: You might notice several familiar Perl concepts in this collection of ACM columns from Jon Bentley.
es: Es posible que encuentre varios conceptos de Perl familiares en esta colección de artículos de la ACM escritos por Jon Bentley.

source: You might try to write that as
es: Puede probar con

source: You might want to keep these desktop references close by your keyboard:
es: Es probable que desee tener estas referencias a mano:

source: You must put the list in parentheses to avoid ambiguity.
es: Debe escribir la lista entre paréntesis para evitar ambigüedades.

source: You must also do this when interpolating a variable into a string to separate the variable name from a following double-colon or an apostrophe, since these would be otherwise treated as a package separator: X<interpolation>
es: También debe hacer esto al interpolar una variable en una cadena para separar el nombre de una variable de un doble signo de dos puntos o un apóstrofo, a fin de evitar que se traten como separadores de paquete: X<interpolation> X<interpolación>

source: You need to perform the same general operations on related types of data, but with slight variations depending on the specific type of data the operations are applied to.
es: Es necesario llevar a cabo las mismas operaciones generales sobre tipos de datos relacionados, pero con ligeras variaciones en función del tipo de datos específico al que se aplican estas operaciones.

source: You needn't worry about whether the names in one such domain have been used in another.
es: Evita tener que preocuparse de si los nombres de un dominio se usan en el otro.

source: You only ever do work in a local branch.
es: Solo se trabaja en una rama local.

source: You really should build the whole distribution on the machine it will eventually live on, and then type C<make install>.
es: Es muy recomendable compilar toda la distribución en el equipo en el que se va a instalar y después ejecutar el comando C<make install>.

source: You should check that a contained object is defined before calling a method on it:
es: Antes de llamar a un método en el objeto, debe comprobar si se han definido objetos contenidos:

source: You should NEVER do work on these remote tracking branches.
es: NUNCA debe trabajar en estas ramas de seguimiento remoto.

source: You should also always run under C<use strict> or know the reason why not.
es: También debe ejecutar siempre los programas con C<use strict>; si no lo hace, debe saber por qué no necesita hacerlo.

source: You should also check out L<perlmodlib> for some style guides on constructing both modules and classes.
es: También debería consultar L<perlmodlib>, que le proporcionará unas directrices para la construcción de módulos y clases.

source: You should also check your modules, and upgrade them if necessary.
es: También debe comprobar los módulos y actualizarlos si es necesario.

source: You should make a module out of any code that you think is going to be useful to others.
es: En un módulo debe incluir código que crea que puede ser de utilidad para otros programadores.

source: You should not even B<want> to use F<setjmp.h> functions, but if you think you do, use the C<JMPENV> stack in F<scope.h> instead.
es: B<Ni se le ocurra> usar las funciones de F<setjmp.h>. Si esto no le disuade de sus intenciones, al menos plantéese usar la pila C<JMPENV> de F<scope.h> en su lugar.

source: You should now send an email to L<perlbug@perl.org|mailto:perlbug@perl.org> with a description of your changes, and include this patch file as an attachment.
es: Una vez hecho esto, debe enviar un mensaje de correo electrónico a L<perlbug@perl.org|mailto:perlbug@perl.org> con una descripción de los cambios y adjuntar el parche al mensaje.

source: You should perform your work on a L<topic branch|/Topic branches and rewriting history>, which you should regularly rebase against blead to ensure that your code is not broken by blead moving.
es: Debe realizar el trabajo en una L<rama puntual|/Ramas puntuales e historial de reescritura>, que habrá que reorganizar regularmente con blead para asegurarse de que el código no deja de funcionar cuando blead se mueva.

source: You shouldn't worry about what this format is, because conversion is automatically done when you decode or encode.
es: No tiene que preocuparse por los detalles, ya que la conversión se realiza automáticamente al descodificar y codificar.

source: You will need the packages mentioned in F<README.dos> in the Perl distribution.
es: Necesitará los paquetes indicados en el archivo F<README.dos> incluido en la distribución de Perl.

source: You will see your commits being re-applied, and you will then be able to push safely.
es: Se volverán a aplicar sus confirmaciones y entonces podrá enviar cambios de forma segura.

source: You will sometimes see older books or documentation mention "blessing a reference" or describe an object as a "blessed reference", but this is incorrect.
es: A veces verá en documentación o en libros antiguos que se habla de "bendecir una referencia" o se describe un objeto como una "referencia bendecida", pero esto no es correcto.

source: You would have been able to just keep using Perl 5 with Parrot, the virtual machine which will compile and run Perl 6 bytecode.
es: Esto permitiría seguir utilizando Perl 5 con Parrot, la máquina virtual que compilará y ejecutará bytecode de Perl 6.

source: You'd be wrong.
es: Se equivoca.

source: You'll notice that perl is not itself written in Perl.
es: Notará que perl no está programado en Perl.

source: You'll have to check their respective release notes to see just what the differences are.
es: Para averiguar cuáles son las diferencias, consulte las notas de la versión correspondiente.

source: You'll need a compiler such as Visual C++.
es: Necesitará un compilador (por ejemplo, Visual C++).

source: You'll need the C<nmake> utility, available at http://download.microsoft.com/download/vc15/Patch/1.52/W95/EN-US/nmake15.exe or dmake, available on CPAN.
es: Necesitará la utilidad C<nmake>, disponible en http://download.microsoft.com/download/vc15/Patch/1.52/W95/EN-US/nmake15.exe, o dmake, disponible en CPAN:

# You'll see the difference right away. " }
source: You'll see the difference right away.\n" }
es: Verá la diferencia inmediatamente.\n" }

source: You're a much better advocate if your claims are reasonable and grounded in reality.
es: Si sus afirmaciones son razonables y están basadas en la realidad, sus esfuerzos de evangelización tendrán más éxito.

source: You're also missing out on an awful lot of useful code; consider having a look at L<perlmod>, L<perlmodlib> and L<perlmodinstall> before coming back here.
es: Además, eso significa que aún no se está beneficiando de una enorme cantidad de código que puede resultarle muy útil; antes de leer este documento debería leer L<perlmod>, L<perlmodlib> y L<perlmodinstall>.

source: You're encouraged to create self-tests for your module to ensure it's working as intended on the myriad platforms Perl supports; if you upload your module to CPAN, a host of testers will build your module and send you the results of the tests.
es: Le animamos a crear pruebas automáticas del módulo para asegurarse de que funciona de la manera prevista en las distintas plataformas compatibles con Perl; si sube el módulo a CPAN, una legión de comprobadores dedicará tiempo a compilar su módulo y enviarle los resultados de las pruebas.

source: You've probably heard terms like "class", "object, "method", and "attribute" before.
es: Probablemente ya conoce términos como "clase", "objeto", "método" y "atributo".

source: Your L</shell> will have certain metacharacters, double-quoted Perl L<strings|/string> have other metacharacters, and L</regular expression> patterns have all the double-quote metacharacters plus some extra ones of their own.
es: Su L</shell> tendrá algunos metacaracteres, las L<cadenas|/cadena> de Perl entre comillas tendrán otros metacaracteres y los patrones de L</expresión regular> tendrán todos los metacaracteres de comillas dobles y otros de su propia cosecha.

source: Your current L</directory>, from which relative pathnames are interpreted by the L</operating system>.
es: El L</directorio> actual, que L</sistema operativo> usa para interpretar las rutas de acceso relativas.

source: Your overridden C<can> method should return a subroutine reference for any method that your C<AUTOLOAD> responds to.
es: Su versión sobrescrita de C<can> debe devolver una referencia a la subrutina para cualquier método al que responda C<AUTOLOAD>.

source: Your program can request an object to do things, but the object gets to decide whether it wants to do them or not.
es: El programa puede pedir al objeto que haga cosas, pero es el objeto el que decide si las hace o no.

source: Your system may also have man pages installed for those modules, in which case you can probably just use the man(1) command.
es: Es posible que también estén instaladas en el sistema páginas de manual para esos módulos, en cuyo caso es probable que desee usar simplemente el comando man(1).

source: Your text string will be sent using the bytes in Perl's internal format.
es: La cadena de texto se enviará con los bytes del formato interno de Perl.

source: Zefram 5.13.8 2010-Dec-20
es: Zefram 5.13.8 2010-Dic-20

source: Zefram 5.17.0 2012-May-26 The 5.17 development track
es: Zefram 5.17.0 2012-May-26 Serie de desarrollo de v5.17

source: Zero-length matches at the end of the previous match are ignored during C<split>.
es: Las coincidencias de longitud cero al final de la coincidencia anterior se ignoran al ejecutar C<split>.

source: [...] [1] Match a character according to the rules of the bracketed character class defined by the "...".
es: [...] [1] Coincidencia de carácter según las reglas de la clase de caracteres definida por "...".

source: [B<-L> I<language_code>]
es: [B<-L> I<código_idioma>]

source: [B<-MI<FormatterClassName>>]
es: [B<-MI<NombreClaseFormateador>>]

source: [B<-dI<destination_file>>]
es: [B<-dI<archivo_destino>>]

source: [B<-n>I<nroff-replacement>]
es: [B<-n>I<sustituto_nroff>]

source: [B<-oI<formatname>>]
es: [B<-oI<nombre_formato>>]

source: [B<-wI<formatteroption:value>>]
es: [B<-wI<opción_formateador:valor>>]

source: [E<lt>Gk many shapes]
es: [admitir muchas formas]

source: [From French, "in passing", as in the exotic pawn-capturing maneuver in chess.]
es: [Del francés, significa "al paso", como en la exótica maniobra de captura de peón del ajedrez].

source: [From Old English]
es: [del inglés arcaico]

source: [Well, it was in F<pp.c> when this tutorial was written.
es: [Bueno, estaba en F<pp.c> en el momento de redactar este tutorial.

source: [[:...:]] [2] Match a character according to the rules of the POSIX character class "..." within the outer bracketed character class.
es: [[:...:]] [2] Coincidencia de carácter según las reglas de la clase de caracteres POSIX "..." dentro de la clase de caracteres más exterior.

source: [] Bracketed Character class
es: [] Clase de caracteres entre corchetes

source: [] anon.
es: [] ref. array

source: [^aeiou] matches a single character outside the given set
es: [^aeiou] un solo carácter no perteneciente al conjunto especificado

source: [aeiou] matches a single character in the given set
es: [aeiou] un solo carácter del conjunto especificado

source: [begin quote]
es: <cita>

source: [end quote]
es: </cita>

source: [from Porting/pumpkin.pod in the Perl source code distribution]
es: [de Porting/pumpkin.pod, incluido en la distribución de código fuente de Perl]

source: \ Quote the next metacharacter
es: \ Escape del metacarácter a continuación

source: \ reference $$foo[1] aka $foo->[1]
es: \ referencia $$foo[1] equivale a $foo->[1]

source: \() list of refs NUMBERS vs STRINGS LINKS
es: \() lista de refs NÚMEROS CADENAS VÍNCULOS

source: \(Dan Faigin still hasn't forgiven me.
es: \(Dan Faigin aún no me lo ha perdonado.

source: \1 [5] Backreference to a specific capture group or buffer.
es: \1 [5] Retrorreferencia a un grupo específico de captura o búfer.

source: \A Match only at beginning of string
es: \A Comienzo de la cadena únicamente

source: \B Match except at a word boundary
es: \B Cualquier cosa excepto un límite de una palabra

source: \C Match a single C-language char (octet) even if that is part of a larger UTF-8 character.
es: \C Coincide con un char (octeto, en lenguaje C) incluso si forma parte de un carácter UTF-8 más grande.

source: \D a non-digit
es: \D un carácter que no sea un dígito

source: \D [3] Match a non-digit character
es: \D [3] Coincide con un carácter que no sea un dígito

source: \E end either case modification or quoted section, think vi
es: \E fin cambio mayúsculas/minúsculas o parte con escape (vi)

source: \G Match only at pos() (e.g. at the end-of-match position
es: \G Coincidencia en pos() únicamente (p. ej. en posición final de última coincidencia

source: \H [3] Not horizontal whitespace
es: \H [3] No espacio en blanco horizontal

source: \K [6] Keep the stuff left of the \K, don't include it in $&
es: \K [6] Olvidar lo que está a la izquierda de \K, no incluir en $&

source: \L lowercase till \E (think vi)
es: \L pasar a minúscula hasta \E (como en vi)

# N [7] Any character but (experimental).
source: \N [7] Any character but \n (experimental).
es: \N [7] Cualquier carácter excepto \n (experimental).

source: \N{U+263D} Unicode character (example: FIRST QUARTER MOON)
es: \N{U+263D} carácter Unicode (ejemplo: FIRST QUARTER MOON)

source: \N{name} named Unicode character or character sequence
es: \N{nombre} carácter o secuencia de caracteres Unicode con nombre

source: \PP [3] Match non-P
es: \PP [3] Coincide con algo que no sea una propiedad

source: \Q quote (disable) pattern metacharacters till \E
es: \Q deshabilitar los metacaracteres hasta \E

source: \R [4] Linebreak
es: \R [4] Salto de línea

source: \S non-whitespace character
es: \S un carácter que no sea un espacio en blanco

source: \S [3] Match a non-whitespace character
es: \S [3] Coincide con un carácter que no sea un espacio en blanco

source: \U uppercase till \E (think vi)
es: \U pasar a mayúscula hasta \E (como en vi)

source: \V [3] Not vertical whitespace
es: \V [3] No espacio en blanco vertical

source: \W a non-word character
es: \W un carácter que no sea de palabra

source: \W [3] Match a non-"word" character
es: \W [3] Coincide con un carácter que no sea de tipo "palabra"

source: \X [4] Match Unicode "eXtended grapheme cluster"
es: \X [4] Coincide con una "agrupación de grafemas eXtendida" de Unicode

source: \Z Match only at end of string, or before newline at the end
es: \Z Final de cadena únicamente, posición anterior a carácter de nueva línea al final

source: \a alarm (bell) (BEL)
es: \a alarma (campana) (BEL)

source: \b Match a word boundary
es: \b Límite de una palabra

source: \cK control char (example: VT)
es: \cK carácter de control (ejemplo: VT)

source: \d a digit (0-9)
es: \d un dígito (0-9)

source: \d [3] Match a decimal digit character
es: \d [3] Coincide con un dígito decimal

source: \e escape (think troff) (ESC)
es: \e escape (como en troff) (ESC)

source: \f form feed (FF)
es: \f avance de página (FF)

source: \g1 [5] Backreference to a specific or previous group,
es: \g1 [5] Retrorreferencia a un grupo específico o anterior.

source: \g{-1} [5] The number may be negative indicating a relative previous group and may optionally be wrapped in curly brackets for safer parsing.
es: \g{-1} [5] El número puede ser negativo, para indicar la posición relativa de un grupo anterior y, opcionalmente, puede escribirse entre llaves, para facilitar el análisis de la expresión regular.

source: \g{name} [5] Named backreference
es: \g{nomb} [5] Retrorreferencia con nombre

source: \h [3] Horizontal whitespace
es: \h [3] Espacio en blanco horizontal

source: \k<name> [5] Named backreference
es: \k<nomb> [5] Retrorreferencia con nombre

source: \l lowercase next char (think vi)
es: \l pasar a minúscula el siguiente carácter (como en vi)

# newline (LF, NL)
source: \n newline (LF, NL)
es: \n nueva línea (LF, NL)

source: \o{}, \000 character whose ordinal is the given octal number
es: \o{}, \000 carácter cuyo ordinal es el número octal indicado

source: \pP [3] Match P, named property.
es: \pP [3] Coincide con P, una propiedad con nombre.

# return (CR)
source: \r return (CR)
es: \r retorno (CR)

source: \s a whitespace character (space, tab, newline, ...)
es: \s un espacio en blanco (espacio, tabulación, nueva línea, ...)

source: \s [3] Match a whitespace character
es: \s [3] Coincide con un espacio en blanco

# tab (HT, TAB)
source: \t tab (HT, TAB)
es: \t tabulación (HT, TAB)

source: \u uppercase next char (think vi)
es: \u pasar a mayúscula el siguiente carácter (como en vi)

source: \v [3] Vertical whitespace
es: \v [3] Espacio en blanco vertical

source: \w a word character (a-z, A-Z, 0-9, _)
es: \w un carácter de palabra (a-z, A-Z, 0-9, _)

source: \w [3] Match a "word" character (alphanumeric plus "_", plus other connector punctuation chars plus Unicode marks)
es: \w [3] Coincide con un carácter de "palabra" (alfanuméricos más "_", otros caracteres de puntuación de continuación y marcas Unicode)

source: \x{}, \x00 character whose ordinal is the given hexadecimal number
es: \x{}, \x00 carácter cuyo ordinal es el número hexadecimal indicado

source: \z Match only at end of string
es: \z Final de cadena únicamente

source: ^ start of string
es: ^ principio de una cadena

source: ^ Match the beginning of the line
es: ^ Principio de la línea

source: __SUB__ is only available in 5.16 or higher, and only with a C<use v5.16> or C<use feature "current_sub"> declaration.
es: __SUB__ solo está disponible en la versión 5.16 o superior, y solo con un C<use v5.16> o una declaración C<use feature "current_sub">.

source: __SUB__ gives a reference to the current subroutine.
es: __SUB__ devuelve una referencia a la subrutina actual.

source: a # non-zero
es: a # distinto de cero
